TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_anacomp0__include
#define ti_devices_msp_peripherals_hw_anacomp0__include

/* This preliminary header file does not have a version number */
/* Filename: hw_anacomp0.h */
/* MMR revised: 2024-11-25 06:21:42 */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/m33c1 */
/* MMR revision: a0f7dca5d4cf924663986bfa1fdd55dddd7aafe8 */
/* Generator revision: daea8c76dae02d21df5916c27b417fe7c2521b12
   (MInT: 7456bc61ab943d25fa56c4258186ef3874017fc3) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* ANACOMP0 Registers
******************************************************************************/
#define ANACOMP0_LMGMT_DFT_ATRT_OFS              ((uint32_t)0x00001E00U)
#define ANACOMP0_INT_EVENT_OFS                   ((uint32_t)0x00001020U)
#define ANACOMP0_GPRCM_OFS                       ((uint32_t)0x00000800U)
#define ANACOMP0_FUPDATE_OFS                     ((uint32_t)0x00000204U)
#define ANACOMP0_PINCM_OFS                       ((uint32_t)0x00000004U)


/** @addtogroup ANACOMP0_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00001E00) Test 0 */
  __IO uint32_t TEST1;                             /* !< (@ 0x00001E04) Test 1 */
       uint32_t RESERVED0[2];
  __IO uint32_t TEST4;                             /* !< (@ 0x00001E10) Test 4 */
  __IO uint32_t TEST5;                             /* !< (@ 0x00001E14) TEST5 Register */
} ANACOMP0_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group ANACOMP0_LMGMT_DFT_ATRT */

/** @addtogroup ANACOMP0_INT_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
       uint32_t RESERVED5;
} ANACOMP0_INT_EVENT_Regs;

/*@}*/ /* end of group ANACOMP0_INT_EVENT */

/** @addtogroup ANACOMP0_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} ANACOMP0_GPRCM_Regs;

/*@}*/ /* end of group ANACOMP0_GPRCM */

/** @addtogroup ANACOMP0_FUPDATE
  @{
*/

typedef struct {
  union {
      __O  uint32_t AIN[14];                           /* !< Comparator input channels */
      __I  uint32_t AIN_STAT_AIN[14];
  };
       uint32_t RESERVED0;
  union {
      __O  uint32_t OUT;                               /* !< Comparator output */
      __I  uint32_t OUT_STAT_OUT;
  };
} ANACOMP0_FUPDATE_Regs;

/*@}*/ /* end of group ANACOMP0_FUPDATE */

/** @addtogroup ANACOMP0_PINCM
  @{
*/

