TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
typedef struct {
  __IO uint32_t AIN[14];                           /* !< (@ 0x00000004) Comparator input channels */
       uint32_t RESERVED0;
  __IO uint32_t OUT;                               /* !< (@ 0x00000040) Comparator output */
} ANACOMP0_PINCM_Regs;

/*@}*/ /* end of group ANACOMP0_PINCM */

/** @addtogroup ANACOMP0
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  ANACOMP0_PINCM_Regs  PINCM;                             /* !< (@ 0x00000004) */
       uint32_t RESERVED1[112];
  ANACOMP0_FUPDATE_Regs  FUPDATE;                           /* !< (@ 0x00000204) */
       uint32_t RESERVED2[111];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subscriber Port 0 */
  __IO uint32_t FSUB_1;                            /* !< (@ 0x00000404) Subscriber Port 1 */
       uint32_t RESERVED3[15];
  __IO uint32_t FPUB_1;                            /* !< (@ 0x00000444) Publisher port 1 */
       uint32_t RESERVED4[14];
  __IO uint32_t CPU_CONNECT_0;                     /* !< (@ 0x00000480) CPU connect 0 configuration byte */
       uint32_t RESERVED5[223];
  ANACOMP0_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED6[514];
  ANACOMP0_INT_EVENT_Regs  INT_EVENT[2];                      /* !< (@ 0x00001020) */
       uint32_t RESERVED7[24];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED8[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  __IO uint32_t CTL0;                              /* !< (@ 0x00001100) Control 0 */
  __IO uint32_t CTL1;                              /* !< (@ 0x00001104) Control 1 */
  __IO uint32_t CTL2;                              /* !< (@ 0x00001108) Control 2 */
  __IO uint32_t CTL3;                              /* !< (@ 0x0000110C) Control 3 */
       uint32_t RESERVED9[4];
  __I  uint32_t STAT;                              /* !< (@ 0x00001120) Status */
       uint32_t RESERVED10[7];
  __IO uint32_t ANACMPWKUPCTL;                     /* !< (@ 0x00001140) Analog comparison wakeup control register */
  __IO uint32_t ANACMPCTRCTL;                      /* !< (@ 0x00001144) Analog comparison counter control register */
  __IO uint32_t ANACMPDACCODE;                     /* !< (@ 0x00001148) Analog comparison DAC codes */
  __IO uint32_t ANACMPWD;                          /* !< (@ 0x0000114C) Window operation control for analog comparison */
  __I  uint32_t ANACMPCHSTS;                       /* !< (@ 0x00001150) Status flag to indicate input channel event
                                                      genration */
  __O  uint32_t ANACMPCHSTSCLR;                    /* !< (@ 0x00001154) Clear register for ANACMPCHSTS status register */
       uint32_t RESERVED11[810];
  ANACOMP0_LMGMT_DFT_ATRT_Regs  LMGMT_DFT_ATRT;                    /* !< (@ 0x00001E00) */
} ANACOMP0_Regs;

/*@}*/ /* end of group ANACOMP0 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* ANACOMP0 Register Control Bits
******************************************************************************/

/* ANACOMP0_TEST0 Bits */
/* ANACOMP0_TEST0[ATB_MUX_BUFSEL] Bits */
#define ANACOMP0_TEST0_ATB_MUX_BUFSEL_OFS        (0)                             /* !< ATB_MUX_BUFSEL Offset */
#define ANACOMP0_TEST0_ATB_MUX_BUFSEL_MASK       ((uint32_t)0x0000000FU)         /* !< This bit field is used to select
                                                                                    ATB mux buffered analog inputs. */
/* ANACOMP0_TEST0[ATB_MUX_UNBUFSEL] Bits */
#define ANACOMP0_TEST0_ATB_MUX_UNBUFSEL_OFS      (8)                             /* !< ATB_MUX_UNBUFSEL Offset */
#define ANACOMP0_TEST0_ATB_MUX_UNBUFSEL_MASK     ((uint32_t)0x00000F00U)         /* !< This bit field is used to select
                                                                                    ATB mux unbuffered analog inputs. */
/* ANACOMP0_TEST0[ATB_UNBUFEN] Bits */
#define ANACOMP0_TEST0_ATB_UNBUFEN_OFS           (29)                            /* !< ATB_UNBUFEN Offset */
#define ANACOMP0_TEST0_ATB_UNBUFEN_MASK          ((uint32_t)0x20000000U)         /* !< This bit is used to enable ATB
                                                                                    unbuffered line */
#define ANACOMP0_TEST0_ATB_UNBUFEN_CLR           ((uint32_t)0x00000000U)         /* !< ATB unbuffered line is disabled */
#define ANACOMP0_TEST0_ATB_UNBUFEN_SET           ((uint32_t)0x20000000U)         /* !< ATB unbuffered line is enabled */
/* ANACOMP0_TEST0[ATB_BUFEN] Bits */
#define ANACOMP0_TEST0_ATB_BUFEN_OFS             (30)                            /* !< ATB_BUFEN Offset */
#define ANACOMP0_TEST0_ATB_BUFEN_MASK            ((uint32_t)0x40000000U)         /* !< This bit is used to enable ATB
                                                                                    buffered line */
#define ANACOMP0_TEST0_ATB_BUFEN_CLR             ((uint32_t)0x00000000U)         /* !< ATB buffered line is disabled */
#define ANACOMP0_TEST0_ATB_BUFEN_SET             ((uint32_t)0x40000000U)         /* !< ATB buffered line is enabled */

/* ANACOMP0_TEST1 Bits */
/* ANACOMP0_TEST1[DTB_MUX_SEL] Bits */
#define ANACOMP0_TEST1_DTB_MUX_SEL_OFS           (0)                             /* !< DTB_MUX_SEL Offset */
#define ANACOMP0_TEST1_DTB_MUX_SEL_MASK          ((uint32_t)0x0000000FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital inputs. */

/* ANACOMP0_TEST4 Bits */
/* ANACOMP0_TEST4[SPAREBITS] Bits */
#define ANACOMP0_TEST4_SPAREBITS_OFS             (0)                             /* !< SPAREBITS Offset */
#define ANACOMP0_TEST4_SPAREBITS_MASK            ((uint32_t)0x000000FFU)         /* !< Spare register bits. These bits are
                                                                                    defined for functional ECO purpose in
                                                                                    design. */
#define ANACOMP0_TEST4_SPAREBITS_MIN             ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define ANACOMP0_TEST4_SPAREBITS_MAX             ((uint32_t)0x000000FFU)         /* !< Maximum Value */

/* ANACOMP0_TEST5 Bits */
/* ANACOMP0_TEST5[HS_COMP_SB_DIS] Bits */
#define ANACOMP0_TEST5_HS_COMP_SB_DIS_OFS        (0)                             /* !< HS_COMP_SB_DIS Offset */
#define ANACOMP0_TEST5_HS_COMP_SB_DIS_MASK       ((uint32_t)0x00000001U)         /* !< Disable HS comp slew boost
                                                                                    implementation. */
#define ANACOMP0_TEST5_HS_COMP_SB_DIS_CLR        ((uint32_t)0x00000000U)         /* !< Enable */
#define ANACOMP0_TEST5_HS_COMP_SB_DIS_SET        ((uint32_t)0x00000001U)         /* !< Disable */
/* ANACOMP0_TEST5[ULP_COMP_SB_DIS] Bits */
#define ANACOMP0_TEST5_ULP_COMP_SB_DIS_OFS       (1)                             /* !< ULP_COMP_SB_DIS Offset */
#define ANACOMP0_TEST5_ULP_COMP_SB_DIS_MASK      ((uint32_t)0x00000002U)         /* !< Disable ULP comp slew boost
                                                                                    implementation. */
#define ANACOMP0_TEST5_ULP_COMP_SB_DIS_CLR       ((uint32_t)0x00000000U)         /* !< Enable */
#define ANACOMP0_TEST5_ULP_COMP_SB_DIS_SET       ((uint32_t)0x00000002U)         /* !< Disable */
/* ANACOMP0_TEST5[HS_COMP_IQQCFG0] Bits */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG0_OFS       (2)                             /* !< HS_COMP_IQQCFG0 Offset */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG0_MASK      ((uint32_t)0x00000004U)         /* !< Increase the IQQ of HS comp by ~67%
                                                                                    to get the desired performance in
                                                                                    terms of delay, offset etc. */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG0_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG0_SET       ((uint32_t)0x00000004U)         /* !< Increase the value */
/* ANACOMP0_TEST5[HS_COMP_IQQCFG1] Bits */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG1_OFS       (3)                             /* !< HS_COMP_IQQCFG1 Offset */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG1_MASK      ((uint32_t)0x00000008U)         /* !< Increase the IQQ of HS comp by ~17%
                                                                                    to get the desired performance in
                                                                                    terms of delay, offset etc. */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG1_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG1_SET       ((uint32_t)0x00000008U)         /* !< Increase the value */
/* ANACOMP0_TEST5[HS_COMP_IQQCFG2] Bits */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG2_OFS       (4)                             /* !< HS_COMP_IQQCFG2 Offset */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG2_MASK      ((uint32_t)0x00000010U)         /* !< Decrease the IQQ of HS comp by ~40%
                                                                                    if there is any bias margin issue on
                                                                                    silicon. */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG2_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_HS_COMP_IQQCFG2_SET       ((uint32_t)0x00000010U)         /* !< Decrease the value */
/* ANACOMP0_TEST5[ULP_COMP_IQQCFG0] Bits */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG0_OFS      (5)                             /* !< ULP_COMP_IQQCFG0 Offset */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG0_MASK     ((uint32_t)0x00000020U)         /* !< Increase the IQQ of ULP comp by
                                                                                    ~67% to get the desired performance
                                                                                    in terms of delay, offset etc. */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG0_CLR      ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG0_SET      ((uint32_t)0x00000020U)         /* !< Increase the value */
/* ANACOMP0_TEST5[ULP_COMP_IQQCFG1] Bits */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG1_OFS      (6)                             /* !< ULP_COMP_IQQCFG1 Offset */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG1_MASK     ((uint32_t)0x00000040U)         /* !< Increase the IQQ of ULP comp by
                                                                                    ~17% to get the desired performance
                                                                                    in terms of delay, offset etc. */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG1_CLR      ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG1_SET      ((uint32_t)0x00000040U)         /* !< Increase the value */
/* ANACOMP0_TEST5[ULP_COMP_IQQCFG2] Bits */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG2_OFS      (7)                             /* !< ULP_COMP_IQQCFG2 Offset */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG2_MASK     ((uint32_t)0x00000080U)         /* !< Decrease the IQQ of ULP comp by
                                                                                    ~40% if there is any bias margin
                                                                                    issue on silicon. */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG2_CLR      ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_ULP_COMP_IQQCFG2_SET      ((uint32_t)0x00000080U)         /* !< Increase the value */
/* ANACOMP0_TEST5[VAR_BUF_IQQCFG0] Bits */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG0_OFS       (8)                             /* !< VAR_BUF_IQQCFG0 Offset */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG0_MASK      ((uint32_t)0x00000100U)         /* !< Increase the IQQ of variable
                                                                                    reference buffer by ~67% to get the
                                                                                    desired performance in terms of
                                                                                    stability, enable time etc. */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG0_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG0_SET       ((uint32_t)0x00000100U)         /* !< Increase the value */
/* ANACOMP0_TEST5[VAR_BUF_IQQCFG1] Bits */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG1_OFS       (9)                             /* !< VAR_BUF_IQQCFG1 Offset */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG1_MASK      ((uint32_t)0x00000200U)         /* !< Increase the IQQ of variable
                                                                                    reference buffer by ~17% to get the
                                                                                    desired performance in terms of
                                                                                    stability, enable time etc. */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG1_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG1_SET       ((uint32_t)0x00000200U)         /* !< Increase the value */
/* ANACOMP0_TEST5[VAR_BUF_IQQCFG2] Bits */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG2_OFS       (10)                            /* !< VAR_BUF_IQQCFG2 Offset */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG2_MASK      ((uint32_t)0x00000400U)         /* !< Decrease the IQQ of variable
                                                                                    reference buffer by ~40% if there is
                                                                                    any bias margin or stability issue on
                                                                                    silicon. */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG2_CLR       ((uint32_t)0x00000000U)         /* !< Default value */
#define ANACOMP0_TEST5_VAR_BUF_IQQCFG2_SET       ((uint32_t)0x00000400U)         /* !< Decrease the value */
/* ANACOMP0_TEST5[HS_COMP_ST2_DIS] Bits */
#define ANACOMP0_TEST5_HS_COMP_ST2_DIS_OFS       (11)                            /* !< HS_COMP_ST2_DIS Offset */
#define ANACOMP0_TEST5_HS_COMP_ST2_DIS_MASK      ((uint32_t)0x00000800U)         /* !< Disbale the 2nd stage of HS comp
                                                                                    and bring out the 2nd stage current
                                                                                    on ATB. */
#define ANACOMP0_TEST5_HS_COMP_ST2_DIS_CLR       ((uint32_t)0x00000000U)         /* !< Enable */
#define ANACOMP0_TEST5_HS_COMP_ST2_DIS_SET       ((uint32_t)0x00000800U)         /* !< Disable */
/* ANACOMP0_TEST5[ULP_COMP_ST2_DIS] Bits */
#define ANACOMP0_TEST5_ULP_COMP_ST2_DIS_OFS      (12)                            /* !< ULP_COMP_ST2_DIS Offset */
#define ANACOMP0_TEST5_ULP_COMP_ST2_DIS_MASK     ((uint32_t)0x00001000U)         /* !< Disbale the 2nd stage of ULP comp
                                                                                    and bring out the 2nd stage current
                                                                                    on ATB. */
#define ANACOMP0_TEST5_ULP_COMP_ST2_DIS_CLR      ((uint32_t)0x00000000U)         /* !< Enable */
#define ANACOMP0_TEST5_ULP_COMP_ST2_DIS_SET      ((uint32_t)0x00001000U)         /* !< Disable */
/* ANACOMP0_TEST5[KCK_RED_ON] Bits */
#define ANACOMP0_TEST5_KCK_RED_ON_OFS            (13)                            /* !< KCK_RED_ON Offset */
#define ANACOMP0_TEST5_KCK_RED_ON_MASK           ((uint32_t)0x00002000U)         /* !< 0 : No effect 1 : Turns ON kickback
                                                                                    reduction mechanism. */
/* ANACOMP0_TEST5[RED_KCK_STRGTH] Bits */
#define ANACOMP0_TEST5_RED_KCK_STRGTH_OFS        (14)                            /* !< RED_KCK_STRGTH Offset */
#define ANACOMP0_TEST5_RED_KCK_STRGTH_MASK       ((uint32_t)0x00004000U)         /* !< 0 : No effect 1 : Reduces the
                                                                                    strength of Kickback reduction
                                                                                    mechanism. */
/* ANACOMP0_TEST5[INC_KCK_STRGTH] Bits */
#define ANACOMP0_TEST5_INC_KCK_STRGTH_OFS        (15)                            /* !< INC_KCK_STRGTH Offset */
#define ANACOMP0_TEST5_INC_KCK_STRGTH_MASK       ((uint32_t)0x00008000U)         /* !< 0 : No effect 1 : Increases the
                                                                                    strength of kickback reduction
                                                                                    mechanism. */

