TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_IIDX Bits */
/* ANACOMP0_IIDX[STAT] Bits */
#define ANACOMP0_IIDX_STAT_OFS                   (0)                             /* !< STAT Offset */
#define ANACOMP0_IIDX_STAT_MASK                  ((uint32_t)0x00000003U)         /* !< Interrupt index status */
#define ANACOMP0_IIDX_STAT_NO_INTR               ((uint32_t)0x00000000U)         /* !< No pending interrupt */
#define ANACOMP0_IIDX_STAT_COMPIFG               ((uint32_t)0x00000002U)         /* !< Comparator output interrupt */
#define ANACOMP0_IIDX_STAT_COMPINVIFG            ((uint32_t)0x00000003U)         /* !< Comparator output inverted
                                                                                    interrupt */
#define ANACOMP0_IIDX_STAT_OUTRDYIFG             ((uint32_t)0x00000004U)         /* !< Comparator output ready interrupt */

/* ANACOMP0_IMASK Bits */
/* ANACOMP0_IMASK[COMPIFG] Bits */
#define ANACOMP0_IMASK_COMPIFG_OFS               (1)                             /* !< COMPIFG Offset */
#define ANACOMP0_IMASK_COMPIFG_MASK              ((uint32_t)0x00000002U)         /* !< Masks COMPIFG */
#define ANACOMP0_IMASK_COMPIFG_CLR               ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define ANACOMP0_IMASK_COMPIFG_SET               ((uint32_t)0x00000002U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* ANACOMP0_IMASK[COMPINVIFG] Bits */
#define ANACOMP0_IMASK_COMPINVIFG_OFS            (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP0_IMASK_COMPINVIFG_MASK           ((uint32_t)0x00000004U)         /* !< Masks COMPINVIFG */
#define ANACOMP0_IMASK_COMPINVIFG_CLR            ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define ANACOMP0_IMASK_COMPINVIFG_SET            ((uint32_t)0x00000004U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */
/* ANACOMP0_IMASK[OUTRDYIFG] Bits */
#define ANACOMP0_IMASK_OUTRDYIFG_OFS             (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP0_IMASK_OUTRDYIFG_MASK            ((uint32_t)0x00000008U)         /* !< Masks OUTRDYIFG */
#define ANACOMP0_IMASK_OUTRDYIFG_CLR             ((uint32_t)0x00000000U)         /* !< Interrupt is masked out */
#define ANACOMP0_IMASK_OUTRDYIFG_SET             ((uint32_t)0x00000008U)         /* !< Interrupt will request an interrupt
                                                                                    service routine and corresponding bit
                                                                                    in MIS will be set */

/* ANACOMP0_RIS Bits */
/* ANACOMP0_RIS[COMPIFG] Bits */
#define ANACOMP0_RIS_COMPIFG_OFS                 (1)                             /* !< COMPIFG Offset */
#define ANACOMP0_RIS_COMPIFG_MASK                ((uint32_t)0x00000002U)         /* !< Raw interrupt status for comparator
                                                                                    output interrupt flag. The IES bit
                                                                                    defines the transition of the
                                                                                    comparator output setting this bit. */
#define ANACOMP0_RIS_COMPIFG_CLR                 ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define ANACOMP0_RIS_COMPIFG_SET                 ((uint32_t)0x00000002U)         /* !< Interrupt pending */
/* ANACOMP0_RIS[COMPINVIFG] Bits */
#define ANACOMP0_RIS_COMPINVIFG_OFS              (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP0_RIS_COMPINVIFG_MASK             ((uint32_t)0x00000004U)         /* !< Raw interrupt status for comparator
                                                                                    output inverted interrupt flag. The
                                                                                    IES bit defines the transition of the
                                                                                    comparator output setting this bit. */
#define ANACOMP0_RIS_COMPINVIFG_CLR              ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define ANACOMP0_RIS_COMPINVIFG_SET              ((uint32_t)0x00000004U)         /* !< Interrupt pending */
/* ANACOMP0_RIS[OUTRDYIFG] Bits */
#define ANACOMP0_RIS_OUTRDYIFG_OFS               (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP0_RIS_OUTRDYIFG_MASK              ((uint32_t)0x00000008U)         /* !< Raw interrupt status for comparator
                                                                                    output ready interrupt flag. This bit
                                                                                    is set when the comparator output is
                                                                                    valid. */
#define ANACOMP0_RIS_OUTRDYIFG_CLR               ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define ANACOMP0_RIS_OUTRDYIFG_SET               ((uint32_t)0x00000008U)         /* !< Interrupt pending */

/* ANACOMP0_MIS Bits */
/* ANACOMP0_MIS[COMPIFG] Bits */
#define ANACOMP0_MIS_COMPIFG_OFS                 (1)                             /* !< COMPIFG Offset */
#define ANACOMP0_MIS_COMPIFG_MASK                ((uint32_t)0x00000002U)         /* !< Masked interrupt status for COMPIFG */
#define ANACOMP0_MIS_COMPIFG_CLR                 ((uint32_t)0x00000000U)         /* !< COMPIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP0_MIS_COMPIFG_SET                 ((uint32_t)0x00000002U)         /* !< COMPIFG requests an interrupt
                                                                                    service routine */
/* ANACOMP0_MIS[COMPINVIFG] Bits */
#define ANACOMP0_MIS_COMPINVIFG_OFS              (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP0_MIS_COMPINVIFG_MASK             ((uint32_t)0x00000004U)         /* !< Masked interrupt status for
                                                                                    COMPINVIFG */
#define ANACOMP0_MIS_COMPINVIFG_CLR              ((uint32_t)0x00000000U)         /* !< COMPINVIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP0_MIS_COMPINVIFG_SET              ((uint32_t)0x00000004U)         /* !< COMPINVIFG requests an interrupt
                                                                                    service routine */
/* ANACOMP0_MIS[OUTRDYIFG] Bits */
#define ANACOMP0_MIS_OUTRDYIFG_OFS               (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP0_MIS_OUTRDYIFG_MASK              ((uint32_t)0x00000008U)         /* !< Masked interrupt status for
                                                                                    OUTRDYIFG */
#define ANACOMP0_MIS_OUTRDYIFG_CLR               ((uint32_t)0x00000000U)         /* !< OUTRDYIFG does not request an
                                                                                    interrupt service routine */
#define ANACOMP0_MIS_OUTRDYIFG_SET               ((uint32_t)0x00000008U)         /* !< OUTRDYIFG requests an interrupt
                                                                                    service routine */

/* ANACOMP0_ISET Bits */
/* ANACOMP0_ISET[COMPIFG] Bits */
#define ANACOMP0_ISET_COMPIFG_OFS                (1)                             /* !< COMPIFG Offset */
#define ANACOMP0_ISET_COMPIFG_MASK               ((uint32_t)0x00000002U)         /* !< Sets COMPIFG in RIS register */
#define ANACOMP0_ISET_COMPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ISET_COMPIFG_SET                ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    set */
/* ANACOMP0_ISET[COMPINVIFG] Bits */
#define ANACOMP0_ISET_COMPINVIFG_OFS             (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP0_ISET_COMPINVIFG_MASK            ((uint32_t)0x00000004U)         /* !< Sets COMPINVIFG in RIS register */
#define ANACOMP0_ISET_COMPINVIFG_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ISET_COMPINVIFG_SET             ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is set */
/* ANACOMP0_ISET[OUTRDYIFG] Bits */
#define ANACOMP0_ISET_OUTRDYIFG_OFS              (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP0_ISET_OUTRDYIFG_MASK             ((uint32_t)0x00000008U)         /* !< Sets OUTRDYIFG in RIS register */
#define ANACOMP0_ISET_OUTRDYIFG_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ISET_OUTRDYIFG_SET              ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is set */

/* ANACOMP0_ICLR Bits */
/* ANACOMP0_ICLR[COMPIFG] Bits */
#define ANACOMP0_ICLR_COMPIFG_OFS                (1)                             /* !< COMPIFG Offset */
#define ANACOMP0_ICLR_COMPIFG_MASK               ((uint32_t)0x00000002U)         /* !< Clears COMPIFG in RIS register */
#define ANACOMP0_ICLR_COMPIFG_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ICLR_COMPIFG_CLR                ((uint32_t)0x00000002U)         /* !< RIS bit corresponding to COMPIFG is
                                                                                    cleared */
/* ANACOMP0_ICLR[COMPINVIFG] Bits */
#define ANACOMP0_ICLR_COMPINVIFG_OFS             (2)                             /* !< COMPINVIFG Offset */
#define ANACOMP0_ICLR_COMPINVIFG_MASK            ((uint32_t)0x00000004U)         /* !< Clears COMPINVIFG in RIS register */
#define ANACOMP0_ICLR_COMPINVIFG_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ICLR_COMPINVIFG_CLR             ((uint32_t)0x00000004U)         /* !< RIS bit corresponding to COMPINVIFG
                                                                                    is cleared */
/* ANACOMP0_ICLR[OUTRDYIFG] Bits */
#define ANACOMP0_ICLR_OUTRDYIFG_OFS              (3)                             /* !< OUTRDYIFG Offset */
#define ANACOMP0_ICLR_OUTRDYIFG_MASK             ((uint32_t)0x00000008U)         /* !< Clears OUTRDYIFG in RIS register */
#define ANACOMP0_ICLR_OUTRDYIFG_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing a 0 has no effect */
#define ANACOMP0_ICLR_OUTRDYIFG_CLR              ((uint32_t)0x00000008U)         /* !< RIS bit corresponding to OUTRDYIFG
                                                                                    is cleared */

/* ANACOMP0_PWREN Bits */
/* ANACOMP0_PWREN[ENABLE] Bits */
#define ANACOMP0_PWREN_ENABLE_OFS                (0)                             /* !< ENABLE Offset */
#define ANACOMP0_PWREN_ENABLE_MASK               ((uint32_t)0x00000001U)         /* !< Enable the power */
#define ANACOMP0_PWREN_ENABLE_DISABLE            ((uint32_t)0x00000000U)         /* !< Disable Power */
#define ANACOMP0_PWREN_ENABLE_ENABLE             ((uint32_t)0x00000001U)         /* !< Enable Power */
/* ANACOMP0_PWREN[KEY] Bits */
#define ANACOMP0_PWREN_KEY_OFS                   (24)                            /* !< KEY Offset */
#define ANACOMP0_PWREN_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define ANACOMP0_PWREN_KEY_UNLOCK_W              ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ANACOMP0_RSTCTL Bits */
/* ANACOMP0_RSTCTL[RESETSTKYCLR] Bits */
#define ANACOMP0_RSTCTL_RESETSTKYCLR_OFS         (1)                             /* !< RESETSTKYCLR Offset */
#define ANACOMP0_RSTCTL_RESETSTKYCLR_MASK        ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define ANACOMP0_RSTCTL_RESETSTKYCLR_NOP         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ANACOMP0_RSTCTL_RESETSTKYCLR_CLR         ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* ANACOMP0_RSTCTL[RESETASSERT] Bits */
#define ANACOMP0_RSTCTL_RESETASSERT_OFS          (0)                             /* !< RESETASSERT Offset */
#define ANACOMP0_RSTCTL_RESETASSERT_MASK         ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define ANACOMP0_RSTCTL_RESETASSERT_NOP          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ANACOMP0_RSTCTL_RESETASSERT_ASSERT       ((uint32_t)0x00000001U)         /* !< Assert reset */
/* ANACOMP0_RSTCTL[KEY] Bits */
#define ANACOMP0_RSTCTL_KEY_OFS                  (24)                            /* !< KEY Offset */
#define ANACOMP0_RSTCTL_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define ANACOMP0_RSTCTL_KEY_UNLOCK_W             ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ANACOMP0_CLKCFG Bits */
/* ANACOMP0_CLKCFG[KEY] Bits */
#define ANACOMP0_CLKCFG_KEY_OFS                  (24)                            /* !< KEY Offset */
#define ANACOMP0_CLKCFG_KEY_MASK                 ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define ANACOMP0_CLKCFG_KEY_UNLOCK               ((uint32_t)0xA9000000U)         /* !< Key value to be used in writing to
                                                                                    this register for the write to take
                                                                                    effect. */
/* ANACOMP0_CLKCFG[BLOCKASYNC] Bits */
#define ANACOMP0_CLKCFG_BLOCKASYNC_OFS           (8)                             /* !< BLOCKASYNC Offset */
#define ANACOMP0_CLKCFG_BLOCKASYNC_MASK          ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define ANACOMP0_CLKCFG_BLOCKASYNC_DISABLE       ((uint32_t)0x00000000U)         /* !< disable COMP to request SYSOSC */
#define ANACOMP0_CLKCFG_BLOCKASYNC_ENABLE        ((uint32_t)0x00000100U)         /* !< enable COMP to request SYSOSC */

/* ANACOMP0_GPRCM_STAT Bits */
/* ANACOMP0_GPRCM_STAT[RESETSTKY] Bits */
#define ANACOMP0_GPRCM_STAT_RESETSTKY_OFS        (16)                            /* !< RESETSTKY Offset */
#define ANACOMP0_GPRCM_STAT_RESETSTKY_MASK       ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define ANACOMP0_GPRCM_STAT_RESETSTKY_NORES      ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define ANACOMP0_GPRCM_STAT_RESETSTKY_RESET      ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

