TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_FUPDATE_AIN Bits */
/* ANACOMP0_FUPDATE_AIN[IOADDR] Bits */
#define ANACOMP0_FUPDATE_AIN_IOADDR_OFS          (2)                             /* !< IOADDR Offset */
#define ANACOMP0_FUPDATE_AIN_IOADDR_MASK         ((uint32_t)0x0FFFFFFCU)         /* !< IO Address This is the address that
                                                                                    corresponds to the SOC address[27:2]
                                                                                    of the module IP instance specific IO
                                                                                    signal in the Full Write subregion of
                                                                                    the pinmux subregion. */
/* ANACOMP0_FUPDATE_AIN[LOCK] Bits */
#define ANACOMP0_FUPDATE_AIN_LOCK_OFS            (1)                             /* !< LOCK Offset */
#define ANACOMP0_FUPDATE_AIN_LOCK_MASK           ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define ANACOMP0_FUPDATE_AIN_LOCK_NOEFFECT       ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define ANACOMP0_FUPDATE_AIN_LOCK_LOCK           ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* ANACOMP0_FUPDATE_AIN[GSEL] Bits */
#define ANACOMP0_FUPDATE_AIN_GSEL_OFS            (0)                             /* !< GSEL Offset */
#define ANACOMP0_FUPDATE_AIN_GSEL_MASK           ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define ANACOMP0_FUPDATE_AIN_GSEL_PCHAN          ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define ANACOMP0_FUPDATE_AIN_GSEL_GCHAN          ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* ANACOMP0_STAT_AIN Bits */
/* ANACOMP0_STAT_AIN[PAD] Bits */
#define ANACOMP0_STAT_AIN_PAD_OFS                (0)                             /* !< PAD Offset */
#define ANACOMP0_STAT_AIN_PAD_MASK               ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* ANACOMP0_FUPDATE_OUT Bits */
/* ANACOMP0_FUPDATE_OUT[IOADDR] Bits */
#define ANACOMP0_FUPDATE_OUT_IOADDR_OFS          (2)                             /* !< IOADDR Offset */
#define ANACOMP0_FUPDATE_OUT_IOADDR_MASK         ((uint32_t)0x0FFFFFFCU)         /* !< IO Address This is the address that
                                                                                    corresponds to the SOC address[27:2]
                                                                                    of the module IP instance specific IO
                                                                                    signal in the Full Write subregion of
                                                                                    the pinmux subregion. */
/* ANACOMP0_FUPDATE_OUT[LOCK] Bits */
#define ANACOMP0_FUPDATE_OUT_LOCK_OFS            (1)                             /* !< LOCK Offset */
#define ANACOMP0_FUPDATE_OUT_LOCK_MASK           ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define ANACOMP0_FUPDATE_OUT_LOCK_NOEFFECT       ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define ANACOMP0_FUPDATE_OUT_LOCK_LOCK           ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* ANACOMP0_FUPDATE_OUT[GSEL] Bits */
#define ANACOMP0_FUPDATE_OUT_GSEL_OFS            (0)                             /* !< GSEL Offset */
#define ANACOMP0_FUPDATE_OUT_GSEL_MASK           ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define ANACOMP0_FUPDATE_OUT_GSEL_PCHAN          ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define ANACOMP0_FUPDATE_OUT_GSEL_GCHAN          ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* ANACOMP0_STAT_OUT Bits */
/* ANACOMP0_STAT_OUT[PAD] Bits */
#define ANACOMP0_STAT_OUT_PAD_OFS                (0)                             /* !< PAD Offset */
#define ANACOMP0_STAT_OUT_PAD_MASK               ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* ANACOMP0_PINCM_AIN Bits */
/* ANACOMP0_PINCM_AIN[PSTATE] Bits */
#define ANACOMP0_PINCM_AIN_PSTATE_OFS            (6)                             /* !< PSTATE Offset */
#define ANACOMP0_PINCM_AIN_PSTATE_MASK           ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define ANACOMP0_PINCM_AIN_PSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define ANACOMP0_PINCM_AIN_PSTATE_HANDOVER       ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define ANACOMP0_PINCM_AIN_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP0_PINCM_AIN_PSTATE_CONC_LOCKED    ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP0_PINCM_AIN[GSTATE] Bits */
#define ANACOMP0_PINCM_AIN_GSTATE_OFS            (14)                            /* !< GSTATE Offset */
#define ANACOMP0_PINCM_AIN_GSTATE_MASK           ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define ANACOMP0_PINCM_AIN_GSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define ANACOMP0_PINCM_AIN_GSTATE_HANDOVER       ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define ANACOMP0_PINCM_AIN_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP0_PINCM_AIN_GSTATE_CONC_LOCKED    ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */

/* ANACOMP0_PINCM_OUT Bits */
/* ANACOMP0_PINCM_OUT[PSTATE] Bits */
#define ANACOMP0_PINCM_OUT_PSTATE_OFS            (6)                             /* !< PSTATE Offset */
#define ANACOMP0_PINCM_OUT_PSTATE_MASK           ((uint32_t)0x000000C0U)         /* !< Peripheral-Analog Channel State */
#define ANACOMP0_PINCM_OUT_PSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< P-Channel is in Unassigned State */
#define ANACOMP0_PINCM_OUT_PSTATE_HANDOVER       ((uint32_t)0x00000040U)         /* !< P-Channel is in Handover State */
#define ANACOMP0_PINCM_OUT_PSTATE_CONC_NOT_LOCKED ((uint32_t)0x00000080U)         /* !< P-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP0_PINCM_OUT_PSTATE_CONC_LOCKED    ((uint32_t)0x000000C0U)         /* !< P-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP0_PINCM_OUT[GSTATE] Bits */
#define ANACOMP0_PINCM_OUT_GSTATE_OFS            (14)                            /* !< GSTATE Offset */
#define ANACOMP0_PINCM_OUT_GSTATE_MASK           ((uint32_t)0x0000C000U)         /* !< GPIO Channel State */
#define ANACOMP0_PINCM_OUT_GSTATE_UNASSIGNED     ((uint32_t)0x00000000U)         /* !< G-Channel is in Unassigned State */
#define ANACOMP0_PINCM_OUT_GSTATE_HANDOVER       ((uint32_t)0x00004000U)         /* !< G-Channel is in Handover State */
#define ANACOMP0_PINCM_OUT_GSTATE_CONC_NOT_LOCKED ((uint32_t)0x00008000U)         /* !< G-Channle is in Connected State and
                                                                                    not Locked (That is F field is
                                                                                    allowed to change without going back
                                                                                    through Unassigned state) */
#define ANACOMP0_PINCM_OUT_GSTATE_CONC_LOCKED    ((uint32_t)0x0000C000U)         /* !< G-Channel is in Connected State and
                                                                                    Locked (That is F field is not
                                                                                    allowed to change to a different
                                                                                    non-Zero value until both G and P
                                                                                    channels go to Unassigned) */
/* ANACOMP0_PINCM_OUT[PIPD] Bits */
#define ANACOMP0_PINCM_OUT_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define ANACOMP0_PINCM_OUT_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< Pull down enable */
#define ANACOMP0_PINCM_OUT_PIPD_NO_PULL_DOWN     ((uint32_t)0x00000000U)         /* !< No pull down */
#define ANACOMP0_PINCM_OUT_PIPD_PULL_DOWN        ((uint32_t)0x00010000U)         /* !< Pull down */
/* ANACOMP0_PINCM_OUT[PIPU] Bits */
#define ANACOMP0_PINCM_OUT_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define ANACOMP0_PINCM_OUT_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< Pull up enable */
#define ANACOMP0_PINCM_OUT_PIPU_NO_PULL_UP       ((uint32_t)0x00000000U)         /* !< No pull up */
#define ANACOMP0_PINCM_OUT_PIPU_PULL_UP          ((uint32_t)0x00020000U)         /* !< Pull up */
/* ANACOMP0_PINCM_OUT[INENA] Bits */
#define ANACOMP0_PINCM_OUT_INENA_OFS             (18)                            /* !< INENA Offset */
#define ANACOMP0_PINCM_OUT_INENA_MASK            ((uint32_t)0x00040000U)         /* !< Input enable */
#define ANACOMP0_PINCM_OUT_INENA_INP_DISABLE     ((uint32_t)0x00000000U)         /* !< Inputs 0 to connected core */
#define ANACOMP0_PINCM_OUT_INENA_INP_ENABLE      ((uint32_t)0x00040000U)         /* !< Inputs IO pad value to connected
                                                                                    core */
/* ANACOMP0_PINCM_OUT[HYSTEN] Bits */
#define ANACOMP0_PINCM_OUT_HYSTEN_OFS            (19)                            /* !< HYSTEN Offset */
#define ANACOMP0_PINCM_OUT_HYSTEN_MASK           ((uint32_t)0x00080000U)         /* !< Hysteresis enable */
#define ANACOMP0_PINCM_OUT_HYSTEN_DIS_HYST       ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define ANACOMP0_PINCM_OUT_HYSTEN_EN_HYST        ((uint32_t)0x00080000U)         /* !< Hysteresis on */
/* ANACOMP0_PINCM_OUT[DRV] Bits */
#define ANACOMP0_PINCM_OUT_DRV_OFS               (20)                            /* !< DRV Offset */
#define ANACOMP0_PINCM_OUT_DRV_MASK              ((uint32_t)0x00700000U)         /* !< Drive strength options */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_0        ((uint32_t)0x00000000U)         /* !< Lowest drive strength */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_1        ((uint32_t)0x00100000U)         /* !< Drive strength 2/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_2        ((uint32_t)0x00200000U)         /* !< Drive strength 3/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_3        ((uint32_t)0x00300000U)         /* !< Drive strength 4/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_4        ((uint32_t)0x00400000U)         /* !< Drive strength 5/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_5        ((uint32_t)0x00500000U)         /* !< Drive strength 6/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_6        ((uint32_t)0x00600000U)         /* !< Drive strength 7/8 */
#define ANACOMP0_PINCM_OUT_DRV_STRENGTH_7        ((uint32_t)0x00700000U)         /* !< Highest drive strength */
/* ANACOMP0_PINCM_OUT[HIGHZ0] Bits */
#define ANACOMP0_PINCM_OUT_HIGHZ0_OFS            (24)                            /* !< HIGHZ0 Offset */
#define ANACOMP0_PINCM_OUT_HIGHZ0_MASK           ((uint32_t)0x01000000U)         /* !< High-Z instead of low output */
#define ANACOMP0_PINCM_OUT_HIGHZ0_DRV_LOW        ((uint32_t)0x00000000U)         /* !< Pin can be driven low */
#define ANACOMP0_PINCM_OUT_HIGHZ0_DRV_HIZ        ((uint32_t)0x01000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    low */
/* ANACOMP0_PINCM_OUT[HIGHZ1] Bits */
#define ANACOMP0_PINCM_OUT_HIGHZ1_OFS            (25)                            /* !< HIGHZ1 Offset */
#define ANACOMP0_PINCM_OUT_HIGHZ1_MASK           ((uint32_t)0x02000000U)         /* !< High-Z instead of high output */
#define ANACOMP0_PINCM_OUT_HIGHZ1_DRV_HIGH       ((uint32_t)0x00000000U)         /* !< Pin can be driven high */
#define ANACOMP0_PINCM_OUT_HIGHZ1_DRV_HIZ        ((uint32_t)0x02000000U)         /* !< Pin is tri-stated instead of driven
                                                                                    high */
/* ANACOMP0_PINCM_OUT[INV] Bits */
#define ANACOMP0_PINCM_OUT_INV_OFS               (26)                            /* !< INV Offset */
#define ANACOMP0_PINCM_OUT_INV_MASK              ((uint32_t)0x04000000U)         /* !< Invert digital input/output
                                                                                    relative to peripheral/GPIO */
#define ANACOMP0_PINCM_OUT_INV_NO_CHNG           ((uint32_t)0x00000000U)         /* !< Input and output are non-inverted */
#define ANACOMP0_PINCM_OUT_INV_CHNG              ((uint32_t)0x04000000U)         /* !< Input and output are inverted */
/* ANACOMP0_PINCM_OUT[WUEN] Bits */
#define ANACOMP0_PINCM_OUT_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define ANACOMP0_PINCM_OUT_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wake up enable */
#define ANACOMP0_PINCM_OUT_WUEN_NO_WAKEUP        ((uint32_t)0x00000000U)         /* !< Wake up not enabled */
#define ANACOMP0_PINCM_OUT_WUEN_WAKEUP           ((uint32_t)0x08000000U)         /* !< Wake up enabled */
/* ANACOMP0_PINCM_OUT[WCOMP] Bits */
#define ANACOMP0_PINCM_OUT_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define ANACOMP0_PINCM_OUT_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wake up compare value */
#define ANACOMP0_PINCM_OUT_WCOMP_MATCH_ZERO      ((uint32_t)0x00000000U)         /* !< Match 0 will wake */
#define ANACOMP0_PINCM_OUT_WCOMP_MATCH_ONE       ((uint32_t)0x10000000U)         /* !< Match 1 will wake */

