TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_FSUB_0 Bits */
/* ANACOMP0_FSUB_0[CHANID] Bits */
#define ANACOMP0_FSUB_0_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP0_FSUB_0_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP0_FSUB_0_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP0_FSUB_0_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP0_FSUB_0_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* ANACOMP0_FSUB_1 Bits */
/* ANACOMP0_FSUB_1[CHANID] Bits */
#define ANACOMP0_FSUB_1_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP0_FSUB_1_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP0_FSUB_1_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP0_FSUB_1_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP0_FSUB_1_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* ANACOMP0_FPUB_1 Bits */
/* ANACOMP0_FPUB_1[CHANID] Bits */
#define ANACOMP0_FPUB_1_CHANID_OFS               (0)                             /* !< CHANID Offset */
#define ANACOMP0_FPUB_1_CHANID_MASK              ((uint32_t)0x000001FFU)         /* !< 0 = disconnected. 1-15 = connected
                                                                                    to channelID = CHANID. */
#define ANACOMP0_FPUB_1_CHANID_MNIMUM            ((uint32_t)0x00000000U)         /* !< 0 is an allowed value, signifying
                                                                                    that the event is unconnected */
#define ANACOMP0_FPUB_1_CHANID_UNCONNECTED       ((uint32_t)0x00000000U)         /* !< A value of 0 specifies that the
                                                                                    event is not connected */
#define ANACOMP0_FPUB_1_CHANID_MAXIMUM           ((uint32_t)0x0000000FU)         /* !< Consult your device datasheet as
                                                                                    the actual allowed maximum may be
                                                                                    less than 15. */

/* ANACOMP0_CPU_CONNECT_0 Bits */
/* ANACOMP0_CPU_CONNECT_0[CPUSS0_CONN] Bits */
#define ANACOMP0_CPU_CONNECT_0_CPUSS0_CONN_OFS   (1)                             /* !< CPUSS0_CONN Offset */
#define ANACOMP0_CPU_CONNECT_0_CPUSS0_CONN_MASK  ((uint32_t)0x00000002U)         /* !< CPUSS0 connect bit. */
#define ANACOMP0_CPU_CONNECT_0_CPUSS0_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define ANACOMP0_CPU_CONNECT_0_CPUSS0_CONN_CONNECTED ((uint32_t)0x00000002U)         /* !< The CPU is connected. */

/* ANACOMP0_EVT_MODE Bits */
/* ANACOMP0_EVT_MODE[INT0_CFG] Bits */
#define ANACOMP0_EVT_MODE_INT0_CFG_OFS           (0)                             /* !< INT0_CFG Offset */
#define ANACOMP0_EVT_MODE_INT0_CFG_MASK          ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define ANACOMP0_EVT_MODE_INT0_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define ANACOMP0_EVT_MODE_INT0_CFG_SOFTWARE      ((uint32_t)0x00000001U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define ANACOMP0_EVT_MODE_INT0_CFG_HARDWARE      ((uint32_t)0x00000002U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */
/* ANACOMP0_EVT_MODE[EVT1_CFG] Bits */
#define ANACOMP0_EVT_MODE_EVT1_CFG_OFS           (2)                             /* !< EVT1_CFG Offset */
#define ANACOMP0_EVT_MODE_EVT1_CFG_MASK          ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT][0] */
#define ANACOMP0_EVT_MODE_EVT1_CFG_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define ANACOMP0_EVT_MODE_EVT1_CFG_SOFTWARE      ((uint32_t)0x00000004U)         /* !< Event handled by software. Software
                                                                                    must clear the associated RIS flag. */
#define ANACOMP0_EVT_MODE_EVT1_CFG_HARDWARE      ((uint32_t)0x00000008U)         /* !< Event handled by hardware. The
                                                                                    hardware (another module) clears
                                                                                    automatically the associated RIS
                                                                                    flag. */

