TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_DESC Bits */
/* ANACOMP0_DESC[MINREV] Bits */
#define ANACOMP0_DESC_MINREV_OFS                 (0)                             /* !< MINREV Offset */
#define ANACOMP0_DESC_MINREV_MASK                ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
/* ANACOMP0_DESC[MAJREV] Bits */
#define ANACOMP0_DESC_MAJREV_OFS                 (4)                             /* !< MAJREV Offset */
#define ANACOMP0_DESC_MAJREV_MASK                ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
/* ANACOMP0_DESC[FEATUREVER] Bits */
#define ANACOMP0_DESC_FEATUREVER_OFS             (12)                            /* !< FEATUREVER Offset */
#define ANACOMP0_DESC_FEATUREVER_MASK            ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
/* ANACOMP0_DESC[MODULEID] Bits */
#define ANACOMP0_DESC_MODULEID_OFS               (16)                            /* !< MODULEID Offset */
#define ANACOMP0_DESC_MODULEID_MASK              ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */

/* ANACOMP0_CTL0 Bits */
/* ANACOMP0_CTL0[IPSEL] Bits */
#define ANACOMP0_CTL0_IPSEL_OFS                  (0)                             /* !< IPSEL Offset */
#define ANACOMP0_CTL0_IPSEL_MASK                 ((uint32_t)0x00000007U)         /* !< Channel input selected for the
                                                                                    positive terminal of the comparator
                                                                                    if IPEN is set to 1. */
#define ANACOMP0_CTL0_IPSEL_CH_0                 ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define ANACOMP0_CTL0_IPSEL_CH_1                 ((uint32_t)0x00000001U)         /* !< Channel 1 selected */
#define ANACOMP0_CTL0_IPSEL_CH_2                 ((uint32_t)0x00000002U)         /* !< Channel 2 selected */
#define ANACOMP0_CTL0_IPSEL_CH_3                 ((uint32_t)0x00000003U)         /* !< Channel 3 selected */
#define ANACOMP0_CTL0_IPSEL_CH_4                 ((uint32_t)0x00000004U)         /* !< Channel 4 selected */
#define ANACOMP0_CTL0_IPSEL_CH_5                 ((uint32_t)0x00000005U)         /* !< Channel 5 selected */
#define ANACOMP0_CTL0_IPSEL_CH_6                 ((uint32_t)0x00000006U)         /* !< Channel 6 selected */
#define ANACOMP0_CTL0_IPSEL_CH_7                 ((uint32_t)0x00000007U)         /* !< Channel 7  selected */
/* ANACOMP0_CTL0[IPEN] Bits */
#define ANACOMP0_CTL0_IPEN_OFS                   (15)                            /* !< IPEN Offset */
#define ANACOMP0_CTL0_IPEN_MASK                  ((uint32_t)0x00008000U)         /* !< Channel input enable for the
                                                                                    positive terminal of the comparator. */
#define ANACOMP0_CTL0_IPEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is disabled */
#define ANACOMP0_CTL0_IPEN_ENABLE                ((uint32_t)0x00008000U)         /* !< Selected analog input channel for
                                                                                    positive terminal is enabled */
/* ANACOMP0_CTL0[IMEN] Bits */
#define ANACOMP0_CTL0_IMEN_OFS                   (31)                            /* !< IMEN Offset */
#define ANACOMP0_CTL0_IMEN_MASK                  ((uint32_t)0x80000000U)         /* !< Channel input enable for the
                                                                                    negative terminal of the comparator. */
#define ANACOMP0_CTL0_IMEN_DISABLE               ((uint32_t)0x00000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is disabled */
#define ANACOMP0_CTL0_IMEN_ENABLE                ((uint32_t)0x80000000U)         /* !< Selected analog input channel for
                                                                                    negative terminal is enabled */
/* ANACOMP0_CTL0[IMSEL] Bits */
#define ANACOMP0_CTL0_IMSEL_OFS                  (16)                            /* !< IMSEL Offset */
#define ANACOMP0_CTL0_IMSEL_MASK                 ((uint32_t)0x00070000U)         /* !< Channel input selected for the
                                                                                    negative terminal of the comparator
                                                                                    if IMEN is set to 1. */
#define ANACOMP0_CTL0_IMSEL_CH_0                 ((uint32_t)0x00000000U)         /* !< Channel 0 selected */
#define ANACOMP0_CTL0_IMSEL_CH_1                 ((uint32_t)0x00010000U)         /* !< Channel 1 selected */
#define ANACOMP0_CTL0_IMSEL_CH_2                 ((uint32_t)0x00020000U)         /* !< Channel 2 selected */
#define ANACOMP0_CTL0_IMSEL_CH_3                 ((uint32_t)0x00030000U)         /* !< Channel 3 selected */
#define ANACOMP0_CTL0_IMSEL_CH_4                 ((uint32_t)0x00040000U)         /* !< Channel 4 selected */
#define ANACOMP0_CTL0_IMSEL_CH_5                 ((uint32_t)0x00050000U)         /* !< Channel 5 selected */
#define ANACOMP0_CTL0_IMSEL_CH_6                 ((uint32_t)0x00060000U)         /* !< Channel 6 selected */
#define ANACOMP0_CTL0_IMSEL_CH_7                 ((uint32_t)0x00070000U)         /* !< Channel 7 selected */

/* ANACOMP0_CTL1 Bits */
/* ANACOMP0_CTL1[ENABLE] Bits */
#define ANACOMP0_CTL1_ENABLE_OFS                 (0)                             /* !< ENABLE Offset */
#define ANACOMP0_CTL1_ENABLE_MASK                ((uint32_t)0x00000001U)         /* !< This bit turns on the comparator.
                                                                                    When the comparator is turned off it
                                                                                    consumes no power. */
#define ANACOMP0_CTL1_ENABLE_OFF                 ((uint32_t)0x00000000U)         /* !< Comparator is off */
#define ANACOMP0_CTL1_ENABLE_ON                  ((uint32_t)0x00000001U)         /* !< Comparator is on */
/* ANACOMP0_CTL1[MODE] Bits */
#define ANACOMP0_CTL1_MODE_OFS                   (1)                             /* !< MODE Offset */
#define ANACOMP0_CTL1_MODE_MASK                  ((uint32_t)0x00000002U)         /* !< This bit selects the comparator
                                                                                    operating mode. */
#define ANACOMP0_CTL1_MODE_FAST                  ((uint32_t)0x00000000U)         /* !< Comparator is in fast mode */
#define ANACOMP0_CTL1_MODE_ULP                   ((uint32_t)0x00000002U)         /* !< Comparator is in ultra-low power
                                                                                    mode */
/* ANACOMP0_CTL1[EXCH] Bits */
#define ANACOMP0_CTL1_EXCH_OFS                   (2)                             /* !< EXCH Offset */
#define ANACOMP0_CTL1_EXCH_MASK                  ((uint32_t)0x00000004U)         /* !< This bit exchanges the comparator
                                                                                    inputs and inverts the comparator
                                                                                    output. */
#define ANACOMP0_CTL1_EXCH_NO_EXC                ((uint32_t)0x00000000U)         /* !< Comparator inputs not exchanged and
                                                                                    output not inverted */
#define ANACOMP0_CTL1_EXCH_EXC                   ((uint32_t)0x00000004U)         /* !< Comparator inputs exchanged and
                                                                                    output inverted */
/* ANACOMP0_CTL1[SHORT] Bits */
#define ANACOMP0_CTL1_SHORT_OFS                  (3)                             /* !< SHORT Offset */
#define ANACOMP0_CTL1_SHORT_MASK                 ((uint32_t)0x00000008U)         /* !< This bit shorts the positive and
                                                                                    negative input terminals of the
                                                                                    comparator. */
#define ANACOMP0_CTL1_SHORT_NO_SHT               ((uint32_t)0x00000000U)         /* !< Comparator positive and negative
                                                                                    input terminals are not shorted */
#define ANACOMP0_CTL1_SHORT_SHT                  ((uint32_t)0x00000008U)         /* !< Comparator positive and negative
                                                                                    input terminals are shorted */
/* ANACOMP0_CTL1[IES] Bits */
#define ANACOMP0_CTL1_IES_OFS                    (4)                             /* !< IES Offset */
#define ANACOMP0_CTL1_IES_MASK                   ((uint32_t)0x00000010U)         /* !< This bit selected the interrupt
                                                                                    edge for COMPIFG and COMPINVIFG. */
#define ANACOMP0_CTL1_IES_RISING                 ((uint32_t)0x00000000U)         /* !< Rising edge sets COMPIFG and
                                                                                    falling edge sets COMPINVIFG */
#define ANACOMP0_CTL1_IES_FALLING                ((uint32_t)0x00000010U)         /* !< Falling edge sets COMPIFG and
                                                                                    rising edge sets COMPINVIFG */
/* ANACOMP0_CTL1[HYST] Bits */
#define ANACOMP0_CTL1_HYST_OFS                   (5)                             /* !< HYST Offset */
#define ANACOMP0_CTL1_HYST_MASK                  ((uint32_t)0x00000060U)         /* !< These bits select the hysteresis
                                                                                    setting of the comparator. */
#define ANACOMP0_CTL1_HYST_NO_HYS                ((uint32_t)0x00000000U)         /* !< No hysteresis */
#define ANACOMP0_CTL1_HYST_LOW_HYS               ((uint32_t)0x00000020U)         /* !< Low hysteresis, typical 10mV */
#define ANACOMP0_CTL1_HYST_MED_HYS               ((uint32_t)0x00000040U)         /* !< Medium hysteresis, typical 20mV */
#define ANACOMP0_CTL1_HYST_HIGH_HYS              ((uint32_t)0x00000060U)         /* !< High hysteresis, typical 30mV */
/* ANACOMP0_CTL1[OUTPOL] Bits */
#define ANACOMP0_CTL1_OUTPOL_OFS                 (7)                             /* !< OUTPOL Offset */
#define ANACOMP0_CTL1_OUTPOL_MASK                ((uint32_t)0x00000080U)         /* !< This bit selects the comparator
                                                                                    output polarity. */
#define ANACOMP0_CTL1_OUTPOL_NON_INV             ((uint32_t)0x00000000U)         /* !< Comparator output is non-inverted */
#define ANACOMP0_CTL1_OUTPOL_INV                 ((uint32_t)0x00000080U)         /* !< Comparator output is inverted */
/* ANACOMP0_CTL1[FLTEN] Bits */
#define ANACOMP0_CTL1_FLTEN_OFS                  (8)                             /* !< FLTEN Offset */
#define ANACOMP0_CTL1_FLTEN_MASK                 ((uint32_t)0x00000100U)         /* !< This bit enables the analog filter
                                                                                    at comparator output. */
#define ANACOMP0_CTL1_FLTEN_DISABLE              ((uint32_t)0x00000000U)         /* !< Comparator output filter is
                                                                                    disabled */
#define ANACOMP0_CTL1_FLTEN_ENABLE               ((uint32_t)0x00000100U)         /* !< Comparator output filter is enabled */
/* ANACOMP0_CTL1[FLTDLY] Bits */
#define ANACOMP0_CTL1_FLTDLY_OFS                 (9)                             /* !< FLTDLY Offset */
#define ANACOMP0_CTL1_FLTDLY_MASK                ((uint32_t)0x00000600U)         /* !< These bits select the comparator
                                                                                    output filter delay. See the
                                                                                    device-specific data sheet for
                                                                                    specific values on comparator
                                                                                    propagation delay for different
                                                                                    filter delay settings. */
#define ANACOMP0_CTL1_FLTDLY_DLY_0               ((uint32_t)0x00000000U)         /* !< Typical filter delay of 70 ns */
#define ANACOMP0_CTL1_FLTDLY_DLY_1               ((uint32_t)0x00000200U)         /* !< Typical filter delay of 500 ns */
#define ANACOMP0_CTL1_FLTDLY_DLY_2               ((uint32_t)0x00000400U)         /* !< Typical filter delay of 1200 ns */
#define ANACOMP0_CTL1_FLTDLY_DLY_3               ((uint32_t)0x00000600U)         /* !< Typical filter delay of 2700 ns */
/* ANACOMP0_CTL1[DACOUTEN] Bits */
#define ANACOMP0_CTL1_DACOUTEN_OFS               (11)                            /* !< DACOUTEN Offset */
#define ANACOMP0_CTL1_DACOUTEN_MASK              ((uint32_t)0x00000800U)         /* !< This bit enables DAC8 output to be
                                                                                    connected to the pin. */
#define ANACOMP0_CTL1_DACOUTEN_DISABLE           ((uint32_t)0x00000000U)         /* !< Disable the DAC8 output
                                                                                    connectivity to pin. */
#define ANACOMP0_CTL1_DACOUTEN_ENABLE            ((uint32_t)0x00000800U)         /* !< Enable the DAC8 output connectivity
                                                                                    to pin. */
/* ANACOMP0_CTL1[WINCOMPEN] Bits */
#define ANACOMP0_CTL1_WINCOMPEN_OFS              (12)                            /* !< WINCOMPEN Offset */
#define ANACOMP0_CTL1_WINCOMPEN_MASK             ((uint32_t)0x00001000U)         /* !< This bit enables window comparator
                                                                                    operation of comparator. */
#define ANACOMP0_CTL1_WINCOMPEN_OFF              ((uint32_t)0x00000000U)         /* !< window comparator is disable */
#define ANACOMP0_CTL1_WINCOMPEN_ON               ((uint32_t)0x00001000U)         /* !< window comparator is enable */

