TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_CTL2 Bits */
/* ANACOMP0_CTL2[REFMODE] Bits */
#define ANACOMP0_CTL2_REFMODE_OFS                (0)                             /* !< REFMODE Offset */
#define ANACOMP0_CTL2_REFMODE_MASK               ((uint32_t)0x00000001U)         /* !< This bit requests ULP_REF bandgap
                                                                                    operation in fast mode(static) or low
                                                                                    power mode (sampled). The local
                                                                                    reference buffer and 8-bit DAC inside
                                                                                    comparator module are also configured
                                                                                    accordingly.  Fast mode operation
                                                                                    offers higher accuracy but consumes
                                                                                    higher current. Low power operation
                                                                                    consumes lower current but with
                                                                                    relaxed reference voltage accuracy.
                                                                                    Comparator requests for reference
                                                                                    voltage from ULP_REF only when REFLVL
                                                                                    > 0. */
#define ANACOMP0_CTL2_REFMODE_STATIC             ((uint32_t)0x00000000U)         /* !< ULP_REF bandgap, local reference
                                                                                    buffer and 8-bit DAC inside
                                                                                    comparator operate in static mode. */
#define ANACOMP0_CTL2_REFMODE_SAMPLED            ((uint32_t)0x00000001U)         /* !< ULP_REF bandgap, local reference
                                                                                    buffer and 8-bit DAC inside
                                                                                    comparator operate in sampled mode. */
/* ANACOMP0_CTL2[REFSRC] Bits */
#define ANACOMP0_CTL2_REFSRC_OFS                 (3)                             /* !< REFSRC Offset */
#define ANACOMP0_CTL2_REFSRC_MASK                ((uint32_t)0x00000038U)         /* !< These bits select the reference
                                                                                    source for the comparator. */
#define ANACOMP0_CTL2_REFSRC_OFF                 ((uint32_t)0x00000000U)         /* !< Reference voltage generator is
                                                                                    disabled (local reference buffer as
                                                                                    well as DAC). */
#define ANACOMP0_CTL2_REFSRC_VDDA_DAC            ((uint32_t)0x00000008U)         /* !< VDDA selected as the reference
                                                                                    source to DAC and DAC output applied
                                                                                    as reference to comparator. */
#define ANACOMP0_CTL2_REFSRC_VREF_DAC            ((uint32_t)0x00000010U)         /* !< VREF selected as reference to DAC
                                                                                    and DAC output applied as reference
                                                                                    to comparator. */
#define ANACOMP0_CTL2_REFSRC_VREF                ((uint32_t)0x00000018U)         /* !< VREF applied as reference to
                                                                                    comparator. DAC is switched off. */
/* ANACOMP0_CTL2[REFSEL] Bits */
#define ANACOMP0_CTL2_REFSEL_OFS                 (7)                             /* !< REFSEL Offset */
#define ANACOMP0_CTL2_REFSEL_MASK                ((uint32_t)0x00000080U)         /* !< This bit selects if the selected
                                                                                    reference voltage is applied to
                                                                                    positive or negative terminal of the
                                                                                    comparator. */
#define ANACOMP0_CTL2_REFSEL_POSITIVE            ((uint32_t)0x00000000U)         /* !< If EXCH bit is 0, the selected
                                                                                    reference is applied to positive
                                                                                    terminal. If EXCH bit is 1, the
                                                                                    selected reference is applied to
                                                                                    negative terminal. */
#define ANACOMP0_CTL2_REFSEL_NEGATIVE            ((uint32_t)0x00000080U)         /* !< If EXCH bit is 0, the selected
                                                                                    reference is applied to negative
                                                                                    terminal. If EXCH bit is 1, the
                                                                                    selected reference is applied to
                                                                                    positive terminal. */
/* ANACOMP0_CTL2[DACCTL] Bits */
#define ANACOMP0_CTL2_DACCTL_OFS                 (16)                            /* !< DACCTL Offset */
#define ANACOMP0_CTL2_DACCTL_MASK                ((uint32_t)0x00010000U)         /* !< This bit determines if the
                                                                                    comparator output or DACSW bit
                                                                                    controls the selection between
                                                                                    DACCODE0 and DACCODE1. */
#define ANACOMP0_CTL2_DACCTL_COMPOUT_SEL         ((uint32_t)0x00000000U)         /* !< Comparator output controls
                                                                                    selection between DACCODE0 and
                                                                                    DACCODE1 */
#define ANACOMP0_CTL2_DACCTL_DACSW_SEL           ((uint32_t)0x00010000U)         /* !< DACSW bit controls selection
                                                                                    between DACCODE0 and DACCODE1 */
/* ANACOMP0_CTL2[DACSW] Bits */
#define ANACOMP0_CTL2_DACSW_OFS                  (17)                            /* !< DACSW Offset */
#define ANACOMP0_CTL2_DACSW_MASK                 ((uint32_t)0x00020000U)         /* !< This bit selects between DACCODE0
                                                                                    and DACCODE1 to 8-bit DAC when DACCTL
                                                                                    bit is 1. */
#define ANACOMP0_CTL2_DACSW_DACCODE0_SEL         ((uint32_t)0x00000000U)         /* !< DACCODE0 selected for 8-bit DAC */
#define ANACOMP0_CTL2_DACSW_DACCODE1_SEL         ((uint32_t)0x00020000U)         /* !< DACCODE1 selected for 8-bit DAC */
/* ANACOMP0_CTL2[BLANKSRC] Bits */
#define ANACOMP0_CTL2_BLANKSRC_OFS               (8)                             /* !< BLANKSRC Offset */
#define ANACOMP0_CTL2_BLANKSRC_MASK              ((uint32_t)0x00000700U)         /* !< These bits select the blanking
                                                                                    source for the comparator. */
#define ANACOMP0_CTL2_BLANKSRC_DISABLE           ((uint32_t)0x00000000U)         /* !< Blanking source disabled */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC1         ((uint32_t)0x00000100U)         /* !< Select Blanking Source 1 */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC2         ((uint32_t)0x00000200U)         /* !< Select Blanking Source 2 */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC3         ((uint32_t)0x00000300U)         /* !< Select Blanking Source 3 */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC4         ((uint32_t)0x00000400U)         /* !< Select Blanking Source 4 */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC5         ((uint32_t)0x00000500U)         /* !< Select Blanking Source 5 */
#define ANACOMP0_CTL2_BLANKSRC_BLANKSRC6         ((uint32_t)0x00000600U)         /* !< Select Blanking Source 6 */
/* ANACOMP0_CTL2[SAMPMODE] Bits */
#define ANACOMP0_CTL2_SAMPMODE_OFS               (24)                            /* !< SAMPMODE Offset */
#define ANACOMP0_CTL2_SAMPMODE_MASK              ((uint32_t)0x01000000U)         /* !< Enable sampled mode of comparator. */
#define ANACOMP0_CTL2_SAMPMODE_DISABLE           ((uint32_t)0x00000000U)         /* !< Sampled mode disabled */
#define ANACOMP0_CTL2_SAMPMODE_ENABLE            ((uint32_t)0x01000000U)         /* !< Sampled mode enabled */

