TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_anacomp0.h
/* ANACOMP0_CTL3 Bits */
/* ANACOMP0_CTL3[DACCODE0] Bits */
#define ANACOMP0_CTL3_DACCODE0_OFS               (0)                             /* !< DACCODE0 Offset */
#define ANACOMP0_CTL3_DACCODE0_MASK              ((uint32_t)0x000000FFU)         /* !< This is the first 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be 0 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256. */
#define ANACOMP0_CTL3_DACCODE0_MNIMUM            ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define ANACOMP0_CTL3_DACCODE0_MAXIMUM           ((uint32_t)0x000000FFU)         /* !< Minimum DAC code value */
/* ANACOMP0_CTL3[DACCODE1] Bits */
#define ANACOMP0_CTL3_DACCODE1_OFS               (16)                            /* !< DACCODE1 Offset */
#define ANACOMP0_CTL3_DACCODE1_MASK              ((uint32_t)0x00FF0000U)         /* !< This is the second 8-bit DAC code.
                                                                                    When the DAC code is 0x0 the DAC
                                                                                    output will be 0 V. When the DAC code
                                                                                    is 0xFF the DAC output will be
                                                                                    selected reference voltage x 255/256. */
#define ANACOMP0_CTL3_DACCODE1_MNIMUM            ((uint32_t)0x00000000U)         /* !< Minimum DAC code value */
#define ANACOMP0_CTL3_DACCODE1_MAXIMUM           ((uint32_t)0x00FF0000U)         /* !< Minimum DAC code value */

/* ANACOMP0_STAT Bits */
/* ANACOMP0_STAT[OUT] Bits */
#define ANACOMP0_STAT_OUT_OFS                    (0)                             /* !< OUT Offset */
#define ANACOMP0_STAT_OUT_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reflects the value of the
                                                                                    comparator output. Writing to this
                                                                                    bit has no effect on the comparator
                                                                                    output. */
#define ANACOMP0_STAT_OUT_LOW                    ((uint32_t)0x00000000U)         /* !< Comparator output is low */
#define ANACOMP0_STAT_OUT_HIGH                   ((uint32_t)0x00000001U)         /* !< Comparator output is high */

/* ANACOMP0_ANACMPWKUPCTL Bits */
/* ANACOMP0_ANACMPWKUPCTL[ANALOGCOMPARISONWAKEUPENABLEBIT] Bits */
#define ANACOMP0_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_OFS (0)                             /* !< ANALOGCOMPARISONWAKEUPENABLEBIT
                                                                                    Offset */
#define ANACOMP0_ANACMPWKUPCTL_ANALOGCOMPARISONWAKEUPENABLEBIT_MASK ((uint32_t)0x00000001U)         /* !< 0: Analog comparison wakeup is
                                                                                    disabled (back ward compatible with
                                                                                    existing IP) 1 : Analog comparison
                                                                                    feature is enabled */

/* ANACOMP0_ANACMPCTRCTL Bits */
/* ANACOMP0_ANACMPCTRCTL[BLKCMPPRD] Bits */
#define ANACOMP0_ANACMPCTRCTL_BLKCMPPRD_OFS      (0)                             /* !< BLKCMPPRD Offset */
#define ANACOMP0_ANACMPCTRCTL_BLKCMPPRD_MASK     ((uint32_t)0x000000FFU)         /* !< Blanking and comparision period */
/* ANACOMP0_ANACMPCTRCTL[CMPPRD] Bits */
#define ANACOMP0_ANACMPCTRCTL_CMPPRD_OFS         (8)                             /* !< CMPPRD Offset */
#define ANACOMP0_ANACMPCTRCTL_CMPPRD_MASK        ((uint32_t)0x00000F00U)         /* !< Comparision period */

/* ANACOMP0_ANACMPDACCODE Bits */
/* ANACOMP0_ANACMPDACCODE[IP0DACCODE] Bits */
#define ANACOMP0_ANACMPDACCODE_IP0DACCODE_OFS    (0)                             /* !< IP0DACCODE Offset */
#define ANACOMP0_ANACMPDACCODE_IP0DACCODE_MASK   ((uint32_t)0x000000FFU)         /* !< Input0 daccode value */
/* ANACOMP0_ANACMPDACCODE[IP1DACCODE] Bits */
#define ANACOMP0_ANACMPDACCODE_IP1DACCODE_OFS    (8)                             /* !< IP1DACCODE Offset */
#define ANACOMP0_ANACMPDACCODE_IP1DACCODE_MASK   ((uint32_t)0x0000FF00U)         /* !< Input1 daccode value */
/* ANACOMP0_ANACMPDACCODE[IP2DACCODE] Bits */
#define ANACOMP0_ANACMPDACCODE_IP2DACCODE_OFS    (16)                            /* !< IP2DACCODE Offset */
#define ANACOMP0_ANACMPDACCODE_IP2DACCODE_MASK   ((uint32_t)0x00FF0000U)         /* !< Input2 daccode value */
/* ANACOMP0_ANACMPDACCODE[IP3DACCODE] Bits */
#define ANACOMP0_ANACMPDACCODE_IP3DACCODE_OFS    (24)                            /* !< IP3DACCODE Offset */
#define ANACOMP0_ANACMPDACCODE_IP3DACCODE_MASK   ((uint32_t)0xFF000000U)         /* !< Input3 daccode value */

/* ANACOMP0_ANACMPWD Bits */
/* ANACOMP0_ANACMPWD[WDEN] Bits */
#define ANACOMP0_ANACMPWD_WDEN_OFS               (0)                             /* !< WDEN Offset */
#define ANACOMP0_ANACMPWD_WDEN_MASK              ((uint32_t)0x00000001U)         /* !< 0 :  Window mode disable 1 :
                                                                                    Window mode enable */
/* ANACOMP0_ANACMPWD[INMUXSEL_WD] Bits */
#define ANACOMP0_ANACMPWD_INMUXSEL_WD_OFS        (1)                             /* !< INMUXSEL_WD Offset */
#define ANACOMP0_ANACMPWD_INMUXSEL_WD_MASK       ((uint32_t)0x00000006U)         /* !< Input mux (Static) selection for
                                                                                    window mode */

/* ANACOMP0_ANACMPCHSTS Bits */
/* ANACOMP0_ANACMPCHSTS[IN0EVT] Bits */
#define ANACOMP0_ANACMPCHSTS_IN0EVT_OFS          (0)                             /* !< IN0EVT Offset */
#define ANACOMP0_ANACMPCHSTS_IN0EVT_MASK         ((uint32_t)0x00000001U)         /* !< Input0 caused event */
/* ANACOMP0_ANACMPCHSTS[IN1EVT] Bits */
#define ANACOMP0_ANACMPCHSTS_IN1EVT_OFS          (1)                             /* !< IN1EVT Offset */
#define ANACOMP0_ANACMPCHSTS_IN1EVT_MASK         ((uint32_t)0x00000002U)         /* !< Input1 caused event */
/* ANACOMP0_ANACMPCHSTS[IN2EVT] Bits */
#define ANACOMP0_ANACMPCHSTS_IN2EVT_OFS          (2)                             /* !< IN2EVT Offset */
#define ANACOMP0_ANACMPCHSTS_IN2EVT_MASK         ((uint32_t)0x00000004U)         /* !< Input2 caused event */
/* ANACOMP0_ANACMPCHSTS[IN3EVT] Bits */
#define ANACOMP0_ANACMPCHSTS_IN3EVT_OFS          (3)                             /* !< IN3EVT Offset */
#define ANACOMP0_ANACMPCHSTS_IN3EVT_MASK         ((uint32_t)0x00000008U)         /* !< Input3 caused event */

/* ANACOMP0_ANACMPCHSTSCLR Bits */
/* ANACOMP0_ANACMPCHSTSCLR[IN0EVTCLR] Bits */
#define ANACOMP0_ANACMPCHSTSCLR_IN0EVTCLR_OFS    (0)                             /* !< IN0EVTCLR Offset */
#define ANACOMP0_ANACMPCHSTSCLR_IN0EVTCLR_MASK   ((uint32_t)0x00000001U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP0_ANACMPCHSTSCLR[IN1EVTCLR] Bits */
#define ANACOMP0_ANACMPCHSTSCLR_IN1EVTCLR_OFS    (1)                             /* !< IN1EVTCLR Offset */
#define ANACOMP0_ANACMPCHSTSCLR_IN1EVTCLR_MASK   ((uint32_t)0x00000002U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP0_ANACMPCHSTSCLR[IN2EVTCLR] Bits */
#define ANACOMP0_ANACMPCHSTSCLR_IN2EVTCLR_OFS    (2)                             /* !< IN2EVTCLR Offset */
#define ANACOMP0_ANACMPCHSTSCLR_IN2EVTCLR_MASK   ((uint32_t)0x00000004U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */
/* ANACOMP0_ANACMPCHSTSCLR[IN3EVTCLR] Bits */
#define ANACOMP0_ANACMPCHSTSCLR_IN3EVTCLR_OFS    (3)                             /* !< IN3EVTCLR Offset */
#define ANACOMP0_ANACMPCHSTSCLR_IN3EVTCLR_MASK   ((uint32_t)0x00000008U)         /* !< Write a 1 to clear corresponding
                                                                                    Interrupt. */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_anacomp0__include */

